Repository: weddige/kcenter-frontend
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: de

source: k-center problems on urban street networks
de: k-center Probleme in städtischen Straßennetzen

source: k-center is often described by the problem to place k fire stations such that the maximal operational distance is minimized. This almost archetypal instance invites to a deeper look at k-center in urban areas.
de: k-center wird oft damit erklärt, dass k Feuerwachen so plaziert werden sollen, dass die maximale Einsatzdistanz minimiert wird. Diese beinahe archetypische Probleminstanzmotiviert dazu, k-center in städtischen Gebieten genauer zu betrachten.

source: This applications shows two approaches to solve the problem: Street networks as metric graphs and point clouds on an euclidean plane. The latter is based on the asumption, that the ratio between the distance on the street network and the beeline does not depend to much on the route.
de: Diese Anwendung zeigt zwei Herangehensweisen an das Problem: Straßennetze als metrische Graphen und als Punktwolken in einer euklidischen Ebene. Letzteres baut auf der Annahme auf, dass das Verhältniss der Entfernung auf dem Straßennetz und der Luftlinie in einem Gebiet weitgehend universell ist.

source: This app depends heavily on JavaScript. Please activate JavaScript!
de: Diese Anwendung benötigt JavaScript. Bitte aktivieren Sie JavaScript!

source: Choose settings
de: Wähle die Parameter

source: Next
de: Weiter

source: Go back
de: Zurück

source: Description
de: Beschreibung

source: Duration
de: Dauer

source: Objective
de: Zielfunktionswert

source: Sorry, but the computation failed. Presumably it timed out.
de: Entschuldigung, aber die Berechnung ist fehlgeschlagen. Vermutlich wurde die Zeitbeschränkung überschritten.

source: The algorithms
de: Die Algorithmen

source: Graph or set of points
de: Graph oder Punktmenge

source: Gonzalez algorithm is applicable to both metric and euclidean k-center. It starts with one arbitrary centre and chooses allways the node furthest from the already chosen nodes as new center. It's depends on fast distance calculations and is therefore much faster for euclidean k-center.
de: Der Algorithmus von Gonzalez is sowohl auf metrische, als auch das euklidische k-center anwendbar. Er beginnt mit einem beliebigen Zentrum und wählt dann immer den Knoten, der am weitesten von den bereits gewählten Zentren entfert ist. Er ist dabei von der schnellen Berechnung von Distanzen abhängig und daher für euklidische k-center deutlich schneller.

source: The result of this algorithm is guaranteed within two times of the optimal solution.
de: Das Ergebniss dieses Algorithmus ist garantiert maximal doppelt so groß, wie das Optimum.

source: Set of points
de: Punktmenge

source: Brandenberg and Roths algorithm is a branch and bound algorithm on coresets. It starts on k different empty sets and adds subsequently new points to them, until all remaining points are within (1+
de: Der Algorithmus von Brandenberg und Roth betrachtete ist ein Branch-and-Bound algorithmus auf Coresets. Er beginnt mit k verschiedenen leeren Mengen und fügt nacheinander neue Punkte zu ihnen hinzu, bis alle verbleibenden Punkte innerhalb des (1+

source: )-times the maximal radius of these sets.
de: )-fachen des maximalen Radius dieser Mengen

source: The result of this algorithm is guaranteed within (1+
de: Der Algorithmus garantiert, dass das Ergebniss innerhalb das (1+

source: )-times of the optimal solution.
de: )-fachen der Optimallösung ist.

source: Grid approximation
de: Apporiximierung über Gitter

source: Shape
de: Umgriss

source: or fraction
de: oder Bruchteil

source: This algorithm tries to use, that on many occasions the input of euclidean k-center consists of a dense cloud of points. Especially if the number of points is much larger than k, most of them have little influence of the result.
de: Dieser Algorithmus nutzt aus, dass in vielen Fällen die Eingabe für euklidische k-center eine dichte Punktwolke ist. Insbesonders, wenn die Anzahl der Punkte deutlich größer als k ist, haben die einzelnen Punkt oft kaum Einfluss auf das Ergebniss.

source: Therefore the problem size can be reduced, if the outline of the cloud of points is computed and filled with suffciently many new points.
de: Daher kann die Problemgröße reduziert werden, indem der Umriss der Punktwolke berechnet wird und anschließend mit neuen Punkten befüllt wird.

source: For the computations on the newly generated instance this algorithm uses Brandenberg and Roths algorithm.
de: Für die Lösung der so generierten Instanz wird der Algorithmus von Brandenberg und Roth verwendet.

source: Ilhan/Pinar
de: Ilhan und Pinar

source: This algorithm yields exact solutions for metric k-center by solving a series of LPs and IPs. The high running times restrict it to instances of less than a few hundred nodes.
de: Dieser Algorithmus berechnet die exakte Lösung für metrische k-center über eine Reihe von LPs und IPs. Die hohe Laufzeit schränkt seine Anwendung allerdings auf Instanzen mit weniger als ein paar hundert Knoten ein.

source: The source of this page can be found on
de: Der Quellcode dieser Webseite befindet sich auf
